{
    "type": "panel",
    "name": "ownership",
    "title": "Rights",
    "description": "Your right to share this data with people",
    "elements": [
      {
        "type": "radiogroup",
        "name": "publisherRights",
        "title": "Do you have the right to make this data open?",
        "isRequired": true,
        "choices": [
          {
            "value": "yes",
            "text": "Yes, you have the rights to open this data up"
          },
          {
            "value": "no",
            "text": "No, you don't have the rights to open up this data"
          },
          {
            "value": "unsure",
            "text": "You're not sure if you have the rights to publish this data as open data"
          },
          {
            "value": "complicated",
            "text": "The rights in this data are complicated or unclear"
          }
        ],
        "description": "If your organisation did not originally create or gather this data then you may not have the right to publish it as open data. If you are not sure, please check with the data owner for their permission. Open data is data that anyone can access, use and share – subject only, at most, to the requirement to attribute and share-alike.",
        "requirement": {
          "level": 1,
          "progressText": "You must have the right to publish this data."
        }
      },
      {
        "type": "text",
        "name": "rightsRiskAssessment",
        "title": "Where do you detail the risks people might encounter if they use this data?",
        "inputType": "url",
        "placeholder": "Risk Documentation URL",
        "visibleIf": "{publisherRights} = 'complicated'",
        "description": "It can be risky for people to use data without a clear legal right to do so. For example, the data might be taken down in response to a legal challenge. Give a URL for a page that describes the risk of using this data.",
        "requirement": {
          "level": 1,
          "progressText": "You should document risks associated with using this data, so people can work out how they want to use it."
        }
      },
      {
        "type": "radiogroup",
        "name": "publisherOrigin",
        "title": "Was the data originally created or generated by you?",
        "visibleIf": "{publisherRights} = 'yes' or {publisherRights} = 'unsure'",
        "choices": [
          {
            "value": "true",
            "text": "Yes"
          },
          {
            "value": "false",
            "text": "No, it uses external sources"
          }
        ],
        "description": "If any part of this data was sourced outside your organisation by other individuals or organisations then you need to give extra information about your right to publish it."
      },
      {
        "type": "radiogroup",
        "name": "thirdPartyOrigin",
        "title": "Was some of this data extracted or calculated from other data?",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false'",
        "choices": [
          {
            "value": "false",
            "text": "No"
          },
          {
            "value": "true",
            "text": "Yes"
          }
        ],
        "description": "An extract or smaller part of someone else's data still means your rights to use it might be affected. There might also be legal issues if you analysed their data to produce new results from it.",
        "requirement": {
          "level": 1,
          "progressText": "You indicated that this data wasn't originally created or gathered by you, and wasn't crowdsourced, so it must have been extracted or calculated from other data sources."
        }
      },
      {
        "type": "radiogroup",
        "name": "thirdPartyOpen",
        "title": "Are all sources of this data already published as open data?",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false' and {thirdPartyOrigin} = 'true'",
        "choices": [
          {
            "value": "false",
            "text": "No"
          },
          {
            "value": "true",
            "text": "Yes"
          }
        ],
        "description": "You're allowed to republish someone else's data if it's already under an open data licence or if their rights have expired or been waived. If any part of this data is not like this then you'll need legal advice before you can publish it.",
        "requirement": {
          "level": 1,
          "progressText": "You should get legal advice to make sure you have the right to publish this data."
        }
      },
      {
        "type": "radiogroup",
        "name": "crowdsourced",
        "title": "Was some of this data crowdsourced?",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false'",
        "choices": [
          {
            "value": "false",
            "text": "No"
          },
          {
            "value": "true",
            "text": "Yes"
          }
        ],
        "description": "If the data includes information contributed by people outside your organisation, you need their permission to publish their contributions as open data.",
        "requirement": {
          "level": 1,
          "progressText": "You indicated that the data wasn't originally created or gathered by you, and wasn't extracted or calculated from other data, so it must have been crowdsourced."
        }
      },
      {
        "type": "radiogroup",
        "name": "crowdsourcedContent",
        "title": "Did contributors to this data use their judgement?",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false' and {crowdsourced} = 'true'",
        "choices": [
          {
            "value": "false",
            "text": "No"
          },
          {
            "value": "true",
            "text": "Yes"
          }
        ],
        "description": "If people used their creativity or judgement to contribute data then they have copyright over their work. For example, writing a description or deciding whether or not to include some data in a dataset would require judgement. So contributors must transfer or waive their rights, or license the data to you before you can publish it."
      },
      {
        "type": "text",
        "name": "claUrl",
        "title": "Where is the Contributor Licence Agreement (CLA)?",
        "inputType": "url",
        "placeholder": "Contributor Licence Agreement URL",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false' and {crowdsourced} = 'true' and {crowdsourcedContent} = 'true'",
        "description": "Give a link to an agreement that shows contributors allow you to reuse their data. A CLA will either transfer contributor's rights to you, waive their rights, or license the data to you so you can publish it."
      },
      {
        "type": "radiogroup",
        "name": "cldsRecorded",
        "title": "Have all contributors agreed to the Contributor Licence Agreement (CLA)?",
        "isRequired": true,
        "visibleIf": "{publisherRights} = 'unsure' and {publisherOrigin} = 'false' and {crowdsourced} = 'true' and {crowdsourcedContent} = 'true'",
        "choices": [
          {
            "value": "false",
            "text": "No"
          },
          {
            "value": "true",
            "text": "Yes"
          }
        ],
        "description": "Check all contributors agree to a CLA before you reuse or republish their contributions. You should keep a record of who gave contributions and whether or not they agree to the CLA.",
        "requirement": {
          "level": 1,
          "progressText": "You must get contributors to agree to a Contributor Licence Agreement (CLA) that gives you the right to publish their work as open data."
        }
      },
      {
        "type": "text",
        "name": "sourceDocumentationUrl",
        "title": "Where do you describe sources of this data?",
        "inputType": "url",
        "placeholder": "Data Sources Documentation URL",
        "visibleIf": "{publisherOrigin} = 'false'",
        "description": "Give a URL that documents where the data was sourced from (its provenance) and the rights under which you publish the data. This helps people understand where the data comes from.",
        "requirement": {
          "level": 1,
          "progressText": "You should document where the data came from and the rights under which you publish it, so people are assured they can use parts which came from third parties."
        }
      },
      {
        "type": "boolean",
        "name": "sourceDocumentationMetadata",
        "title": "Is documentation about the sources of this data also in machine-readable format?",
        "visibleIf": "{publisherOrigin} = 'false' and {sourceDocumentationUrl} != ''",
        "description": "Information about data sources should be human-readable so people can understand it, as well as in a metadata format that computers can process. When everyone does this it helps other people find out how the same open data is being used and justify its ongoing publication.",
        "requirement": {
          "level": 2,
          "requireTrue": true,
          "progressText": "You should include machine-readable data about the sources of this data."
        }
      },
      {
        "type": "radiogroup",
        "name": "publisherownership",
        "title": {
          "default": "Do you own all the data in this dataset?",
          "es": "¿Es usted el propietario de todos los datos en este conjunto de datos?"
        },
        "isRequired": true,
        "choices": [
          {
            "value": "yes",
            "text": {
              "default": "Yes, my organisation owns all the data and has the rights to open it up.",
              "es": "Sí, mi organización posee todos los datos y tiene los derechos para hacerlos públicos."
            }
          },
          {
            "value": "no",
            "text": {
              "default": "No, it contains data or structure owned by third parties.",
              "es": "No, contiene datos o estructuras que son propiedad de terceros."
            }
          },
          {
            "value": "uncopyrightable",
            "text": {
              "default": "The data consists only of facts and other uncopyrightable material.",
              "es": "Los datos consisten únicamente en hechos y otro material no sujeto a derechos de autor."
            },
            "description": {
              "default": "Data that consists solely of facts or raw information may not be subject to copyright, but database rights or other restrictions might still apply. Ensure no additional rights apply to the data before proceeding.",
              "es": "Los datos que consisten únicamente en hechos o información en bruto pueden no estar sujetos a derechos de autor, pero pueden aplicarse derechos de bases de datos u otras restricciones. Asegúrese de que no se apliquen derechos adicionales a los datos antes de continuar."
            }
          },
          {
            "value": "unsure",
            "text": {
              "default": "I'm unsure and need help determining ownership and rights.",
              "es": "No estoy seguro y necesito ayuda para determinar la propiedad y los derechos."
            }
          },
          {
            "value": "complicated",
            "text": {
              "default": "The rights for this data are complex or unclear.",
              "es": "Los derechos sobre estos datos son complejos o poco claros."
            }
          }
        ],
        "description": {
          "default": "Clearly understanding the ownership of your data is crucial for determining whether you have the rights to publish it as open data. If the data includes content from third parties, or if it uses formats, schemas, or structures created by others, you may need additional permissions. Check with the data owner, legal team, or relevant advisor to confirm your rights before proceeding.",
          "es": "Comprender claramente la propiedad de sus datos es crucial para determinar si tiene los derechos para publicarlos como datos abiertos. Si los datos incluyen contenido de terceros o utilizan formatos, esquemas o estructuras creados por otros, es posible que necesite permisos adicionales. Consulte con el propietario de los datos, el equipo legal o un asesor relevante para confirmar sus derechos antes de continuar."
        },
        "requirement": {
          "level": 1,
          "progressText": {
            "default": "Ensure you have a clear legal right to publish this data.",
            "es": "Asegúrese de tener un derecho legal claro para publicar estos datos."
          }
        }
      },
      {
        "type": "boolean",
        "name": "thirdPartyData",
        "title": {
          "default": "Does the data itself contain any data that was derived from or is directly owned by a third party?",
          "es": "¿Contiene los datos información derivada o directamente propiedad de un tercero?"
        },
        "visibleIf": "{publisherownership} = 'no' or {publisherownership} = 'unsure'",
        "isRequired": true,
        "description": {
          "default": "Some datasets combine information from multiple sources, like other datasets or third-party APIs, which may have licences or terms restricting sharing. For example, resolving an address using a postcode/zipcode lookup service.",
          "es": "Algunos conjuntos de datos combinan información de múltiples fuentes, como otros conjuntos de datos o API de terceros, que pueden tener licencias o términos que restrinjan su compartición. Por ejemplo, resolver una dirección utilizando un servicio de búsqueda de códigos postales o zip."
        },
        "requirement": {
          "level": 1,
          "requireTrue": false,
          "progressText": {
            "default": "Ensure you have clarified any third party rights in the data.",
            "es": "Asegúrese de haber aclarado cualquier derecho de terceros en los datos."
          }
        }
      },
      {
        "type": "boolean",
        "name": "thirdPartyStructure",
        "title": {
          "default": "Is the data in a format or structure that contains a third-party right?",
          "es": "¿Está el formato o la estructura de los datos sujeto a derechos de terceros?"
        },
        "description": {
          "default": "If you use a proprietary schema, such as one defined by a commercial organisation, a licensed data format like a patented file structure, or a third-party naming convention such as a product code or trademarked identifier, there may be restrictions on how the data can be shared or reused",
          "es": "Si utiliza un esquema propietario, como uno definido por una organización comercial, un formato de datos con licencia como una estructura de archivo patentada, o una convención de nombres de terceros, como un código de producto o un identificador registrado, puede haber restricciones sobre cómo se pueden compartir o reutilizar los datos."
        }
      }
    ]
}